<script setup lang="ts">
const faqs = ref([
  {
    question: "Що таке Novita?",
    answer: "Novita — це сучасна платформа з великою колекцією високоякісних зображень на різні теми. Ми надаємо зручну бібліотеку для маркетологів, дизайнерів, комерційних проєктів та блогерів."
  },
  {
    question: "Як шукати зображення на Novita?",
    answer: "Просто введіть ключові слова у пошуковий рядок на головній сторінці. Алгоритм відобразить список відповідних зображень. Ви можете звузити пошук за категорією, кольором та орієнтацією зображення."
  },
  {
    question: "Як придбати зображення на Novita?",
    answer: "Створіть акаунт, оберіть зображення та додайте їх у кошик. Потім переходьте до оплати. Ми підтримуємо безпечні платежі картками та PayPal."
  },
  {
    question: "Як працює підписка на Novita?",
    answer: "Підписка надає доступ до бібліотеки зображень без роялті. Ви отримуєте певну кількість завантажень щомісяця. Місячну підписку можна скасувати в будь-який час, річна підписка діє 12 місяців та дозволяє заощадити до 40%."
  },
  {
    question: "Що таке Автооновлення?",
    answer: "Автооновлення забезпечує безперервний доступ до контенту. Пакети продовжуються автоматично, коли закінчуються завантаження або спливає рік. Налаштування автооновлення можна змінити на сторінці планів."
  },
  {
    question: "Чи можна змінити план на інший?",
    answer: "Так, ви можете збільшити або зменшити кількість завантажень. Зверніться до нашої підтримки, і ми допоможемо з оновленням плану."
  },
  {
    question: "Чи можна отримати повернення коштів при скасуванні плану?",
    answer: "Як правило, Novita не повертає гроші після оплати. У ЄС можливий повернення протягом 14 днів за умови, що завантаження або кредити не були використані."
  },
  {
    question: "Чи зображення на Novita без роялті?",
    answer: "Так, усі зображення без роялті. Після придбання ви можете використовувати їх комерційно та некомерційно без додаткових платежів, але не можна перепродувати."
  },
  {
    question: "Чи можна використовувати зображення для клієнтів?",
    answer: "Так, але ліцензія надається тим, хто робить покупку. Клієнти повинні отримати власну ліцензію для прямого доступу."
  },
  {
    question: "Які формати файлів доступні для завантаження?",
    answer: "Зображення у високій роздільній здатності у форматі PNG, сумісні з більшістю дизайнерських платформ і програм."
  },
  {
    question: "Чи можна замовити спеціальні зображення, яких немає на Novita?",
    answer: "Так, зверніться до нашої служби підтримки з деталями запиту, і ми допоможемо знайти потрібне зображення."
  },
  {
    question: "Як зв’язатися зі службою підтримки Novita?",
    answer: "Пишіть нам на ka4ivan.dev@gmail.com. Підтримка доступна з понеділка по п’ятницю, 9:00–18:00 (GMT)."
  },
]);
</script>

<template>
  <section class="typography">
    <div class="container">
      <h1 class="typography__title">FAQ</h1>

      <template v-for="(faq, index) in faqs" :key="index">
        <h2 class="typography__alert">{{ faq.question }}</h2>

        <p class="typography__text">
          {{ faq.answer }}
        </p>
      </template>
    </div>
  </section>
</template>

<style scoped>

</style>